Revit 2027 API
ScheduleFilter.GetIntegerValue Method
 Gets the filter value for a filter using an integer value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetIntegerValue()
Public Function GetIntegerValue As Integer
public:
int GetIntegerValue()
member GetIntegerValue : unit -> int
Return Value
Int32
 The filter value.
Exceptions
Exception | Condition
InvalidOperationException |  The filter value is not an integer.
See Also
Reference
ScheduleFilter Class
Autodesk.Revit.DB Namespace